export default function ProfileIcon({ 
  color = '#A2A2A2', 
  size = 21,
  style = {},
  ...props 
}) {
  // Вычисляем высоту пропорционально ширине
  
  return (
    <svg 
      width={size} 
      height={size} 
      viewBox="0 0 21 26" 
      fill="none" 
      xmlns="http://www.w3.org/2000/svg"
      style={style}
      {...props}
    >
      <path 
        d="M10.5 0C7.02265 0 4.2037 2.827 4.2037 6.31429C4.2037 9.80157 7.02265 12.6286 10.5 12.6286C13.9773 12.6286 16.7963 9.80157 16.7963 6.31429C16.7963 2.827 13.9773 0 10.5 0Z" 
        fill={color}
      />
      <path 
        d="M14.2157 15.4377C11.7541 15.0438 9.24587 15.0438 6.78434 15.4377L6.5205 15.48C3.05211 16.0351 0.5 19.0353 0.5 22.5576C0.5 24.4588 2.0368 26 3.93254 26H17.0675C18.9632 26 20.5 24.4588 20.5 22.5576C20.5 19.0353 17.9479 16.0351 14.4795 15.48L14.2157 15.4377Z" 
        fill={color}
      />
    </svg>
  );
}